Musadjan/AN1160_dsPIC33FJ32MC204/AN1160 MC204 dsPICDEM MCLV rev2.c
/******************************************************************************/
//
//							 Software License Agreement
//
// CODE OWNERSHIP AND DISCLAIMER OF LIABILITY

// Microchip Technology Incorporated ("Microchip") retains 
// all ownership and intellectual property rights in the code 
// accompanying this message and in all derivatives hereto.  
// You may use this code, and any derivatives created by any 
// person or entity by or on your behalf, exclusively with 
// Microchip’s proprietary products.  Your acceptance and/or 
// use of this code constitutes agreement to the terms and 
// conditions of this notice.

// CODE ACCOMPANYING THIS MESSAGE IS SUPPLIED BY MICROCHIP "AS IS".  
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, 
// BUT NOT LIMITED TO, IMPLIED WARRANTIES OF NON-INFRINGEMENT, 
// MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO 
// THIS CODE, ITS INTERACTION WITH MICROCHIP’S PRODUCTS, COMBINATION 
// WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 

// YOU ACKNOWLEDGE AND AGREE THAT, IN NO EVENT, SHALL MICROCHIP BE 
// LIABLE, WHETHER IN CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE
// OR BREACH OF STATUTORY DUTY), STRICT LIABILITY, INDEMNITY, CONTRIBUTION,
// OR OTHERWISE, FOR ANY INDIRECT, SPECIAL, PUNITIVE, EXEMPLARY, INCIDENTAL 
// OR CONSEQUENTIAL LOSS, DAMAGE, FOR COST OR EXPENSE OF ANY KIND WHATSOEVER
// RELATED TO THE CODE, HOWSOEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED
// OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
// ALLOWABLE BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY 
// RELATED TO THIS CODE, SHALL NOT EXCEED THE PRICE YOU PAID DIRECTLY TO 
// MICROCHIP SPECIFICALLY TO HAVE THIS CODE DEVELOPED.

// You agree that you are solely responsible for testing the code and
// determining its suitability.  Microchip has no obligation to modify,
// test, certify, or support the code.

/*****************************************************************************/
//	File:		AN1160 MC204 dsPICDEM MCLV.c
//
// This program commutates a sensor less BLDC motor using closed PI loop.
// The circuit and operation is as depicted in AN1160. 
//
//	Written By:		Daniel Torres, 
//				Microchip Technology Inc
//						
// 
// The following files should be included in the MPLAB project:
//
//		AN1160 MC204 dsPICDEM MCLV.c	-- Main source code file
//      RTDMUSER.h                      -- RTDM user definitions header file
//      RTDM.h                          -- RTDM header file
//      RTDM.c                          -- RTDM source code file
//		p33FJ12MC204.h		            -- MPLAB-C30  dsPIC33FJ12MC202 processor header
//		p33FJ12MC204.gld		        -- Linker script file
//				
//
/*****************************************************************************/
//
// Revision History
//
// 12/3/07  -- First Version Close Loop with BEMF sensing using the ADC
// 12/10/07 -- Adding comments and modifying global variables names
// 2/22/08 -- Spell Checking, Dead Variable Clean up, Ramp up bug
// 5/5/08   -- DMCI with real-time data monitor added
// 6/04/08 -- SW migrated to the dsPICDEM MCLV board
// 6/17/08 -- Commens addded, PI coefficients recalculated,
/*****************************************************************************/

#include "p33FJ32MC204.h"
#include "dsp.h"

/********************Setting Configuration Bits *********************************/
/* Internal FRC Oscillator */
_FOSCSEL(FNOSC_FRC);

/*  Clock Switching is enabled and 
**  Fail Safe Clock Monitor is disabled
**	OSC2 Pin Function: OSC2 is Clock Output
**	Primary Oscillator Mode: Disabled */
_FOSC(FCKSM_CSECMD & OSCIOFNC_ON  & POSCMD_NONE); 

/*Watchdog Timer Enabled/disabled by user software*/
_FWDT(FWDTEN_OFF);  

/* PWM Output Pin Reset: Controlled by Port Register
** PWM High Side Polarity: Active High
** PWM Low Side Polarity: Active High */
_FPOR(PWMPIN_ON & HPOL_ON & LPOL_ON);

/* Background Debug Enable Bit: Device will Reset in user mode
** Debugger/Emulator Enable Bit: Reset in operational mode
** JTAG Enable Bit: JTAG is disabled
** ICD communication channel select bits: communicate on PGC3/EMUC3 and PGD3/EMUD3 **/
//_FICD(BKBUG_ON & COE_ON & JTAGEN_OFF & ICS_PGD3);
	
/*****************************SYSTEM DEFINES***********************************/
/*FREQUENCY SYSTEM DEFINES*/
#define FCY  29491200			//FRC w/PLL x16
#define MILLISEC FCY/29491		//1 mSec delay constant
#define FPWM 20000				//20KHz PWM Freq
#define S3	 !PORTBbits.RB4		//Defines for the Push Buttons status
#define S2       !PORTAbits.RA8
/******************************************************************************
* OPEN LOOP DEFINITION
* If defined then the compiler will add the PID controller for speed
*******************************************************************************/
#define CLOSELOOPMODE

/********************* Motor Control Definitions *********************************/
/*START-UP SEQUENCE PARAMETERS*/	// Maximum PWM pulses applied to motor 						
#define MAX_PWM_TICKS 1230 		//for detecting initial rotor position
#define RAM_UP_DELAY  0    	 	// Delay for the ramp up sequence, expressed in millisecond
#define MAX_DUTY_CYCLE 1400  	// 100% duty cycle P1DC1=P1DC2=P1DC3 = 1469
#define MIN_DUTY_CYCLE 40	 	// 2.7% duty cycle P1DC1=P1DC2=P1DC3 = 72
#define PHASE_ADVANCE_DEGREES 25 //Phase advance angles to get the best motor performance
#define BLANKING_COUNT 5		//Blanking count expressed in PWM periods used to avoid false zero-crossing detection after commutating motor
#define POLEPAIRS 12			 	// Number of pole pairs of the motor
/*PI CONTROLLER PARAMETER, CONVERSION SPEED FACTOR */
// SPEEDMULT = (TIMER2 TIMEBASE/PWM TIMEBASE) * MAX_DUTY_CYLE*2	
#define SPEEDMULT	94016			// Factor used to calculated speed PWM TIMEBASE = FCY/2, TIMER2 TIMEBASE / FCY/64
#define INDEX		1				// Commutation base index
#define DEBOUNCE_DELAY 	20			// Push button debounce delay, expressed in millisecond


/* Six-Step Commutation States*/
/*PHASE A is MI,  PHASE B is M2, PHASE C is M3 in the dsPICDEM MCLV board*/
/* State 0x2001 Connect the PHASE A to -Vbus & PHASE C to +Vbus */
/* State 0x2004 Connect the PHASE B to -Vbus & PHASE C to +Vbus */
/* State 0x0204 Connect the PHASE B to -Vbus & PHASE A to +Vbus */
/* State 0x0210 Connect the PHASE C to -Vbus & PHASE A to +Vbus */
/* State 0x0810 Connect the PHASE C to -Vbus & PHASE B to +Vbus */
/* State 0x0801 Connect the PHASE A to -Vbus & PHASE B to +Vbus */
const unsigned int PWM_STATE[]	=	{0x0000,0x2001,0x2004,0x0204,0x0210,0x0810,0x0801,0x0000};

/*AND & OR operators for masking the active BEMF signal*/
const unsigned int ADC_MASK[8]	=   {0x0000,0x0002,0x0001,0x0004,0x0002,0x0001,0x0004,0x0000};
const unsigned int ADC_XOR[8]	=   {0x0000,0x0000,0xFFFF,0x0000,0xFFFF,0x0000,0xFFFF,0x0000};

/*BEMF Majority Function Filter values*/
const unsigned char ADC_BEMF_FILTER[64]=
									{0x00,0x02,0x04,0x06,0x08,0x0A,0x0C,0x0E,0x10,0x12,0x14,0x16,0x18,0x1A,0x1C,0x1E,
									 0x20,0x22,0x24,0x26,0x28,0x2A,0x2C,0x2E,0x01,0x01,0x01,0x36,0x01,0x3A,0x3C,0x3E,
									 0x00,0x02,0x04,0x06,0x08,0x0A,0x0C,0x0E,0x01,0x01,0x01,0x16,0x01,0x1A,0x1C,0x1E,
									 0x01,0x01,0x01,0x26,0x01,0x2A,0x2C,0x2E,0x01,0x01,0x01,0x36,0x01,0x3A,0x3C,0x3E};
/*Application Flags to indicate the motor status*/
struct {
			unsigned RunMotor : 	  1;
                        unsigned RotorAlignment : 1;
			unsigned unused :		  14;     
		}Flags;        

