Musadjan/AN1160_dsPIC33FJ32MC204/AN1160 MC204 dsPICDEM MCLV rev2.c
#ifdef CLOSELOOPMODE					
				//Init PI controller variables
				DesiredSpeed = (int)((ReferenceSpeed*3)/2);
				CurrentSpeed = 0;

				// load the PID gain coeffecients into an array;
				PIDGainCoefficients[0] = SpeedControl_P;
				PIDGainCoefficients[1] = SpeedControl_I;
				PIDGainCoefficients[2] = SpeedControl_D;				

				// Initialize the PIDStructure variable before calculation the K1, K2, and K3 terms	
				PIDStructure.abcCoefficients = abcCoefficients;	
				PIDStructure.controlHistory = controlHistory;
				PIDCoeffCalc(PIDGainCoefficients, &PIDStructure);
				// initialize control history
				PIDInit(&PIDStructure);
				PIDStructure.controlOutput = MIN_DUTY_CYCLE;
#endif
								
               // }
			}//end of motor running loop
		}//end of infinite loop

 return 0;
}//end of main function



/******************************************************************************
* Function:     _ADCInterrupt(void) 


*
* Output:		None
*
* Overview:		ADC interrupt used to measure the BEMF signals, reconstruct
* 				the Motor Virtual Neutral Point and compare the BEMF signals
*				against the neutral point reference to detect the zero-crossing 
*				event
*
* Note:			None
*******************************************************************************/
void __attribute__((__interrupt__,auto_psv)) _ADC1Interrupt(void)
{
	ReferenceSpeed = ADC1BUF0;	//ADC CH0 holds the POT value
	if(ReferenceSpeed < (MIN_DUTY_CYCLE*2)/3)
		ReferenceSpeed = (MIN_DUTY_CYCLE*2)/3;
		
	MotorPhaseA = ADC1BUF1;		//ADC CH1 holds the Phase A value
	MotorPhaseB = ADC1BUF2;		//ADC CH2 holds the Phase B value
	MotorPhaseC = ADC1BUF3;		//ADC CH3 holds the Phase C value
	//Reconstrucs Voltage at the  Motor Neutral Point
	MotorNeutralVoltage = (MotorPhaseA + MotorPhaseB + MotorPhaseC)/3; 

	/********************* ADC SAMPLING & BMEF signals comparison ****************/
	if(BlankingCounter > BLANKING_COUNT){
		ComparatorOutputs = 0;						// Precondition all comparator bits as zeros
		if(MotorPhaseA > MotorNeutralVoltage)
			ComparatorOutputs += 1;					// Set bit 0 when Phase C is higher than Neutural
		if(MotorPhaseB > MotorNeutralVoltage)
			ComparatorOutputs += 2;					// Set bit 1 when Phase C is higher than Neutural
		if(MotorPhaseC > MotorNeutralVoltage)
			ComparatorOutputs += 4;					// Set bit 2 when Phase C is higher than Neutral
	}
	AD1CON1bits.DONE = 0;
	IFS0bits.AD1IF = 0;
}


/******************************************************************************
* Function:     _PWMInterrupt(void)
*
* Output:		None
*
* Overview:		PWM reload interrupt used to filter the BEMF signals using the
*				Majority detection filter to detect a valid zero-crossing event
*				if a valid zero-crossing event was detected then PreCommutationState.
*				This function also includes the start-up sequence for detecting
*				the initial rotor position
*
* Note:			None
*******************************************************************************/
void __attribute__((__interrupt__,auto_psv)) _MPWM1Interrupt(void)
{
	//Sets the ADC sampling point according to the PWM duty cycle
	if(CurrentPWMDutyCycle>160)
		P1SECMPbits.SEVTCMP = CurrentPWMDutyCycle>>1;
	else if(CurrentPWMDutyCycle>76)
		P1SECMPbits.SEVTCMP = CurrentPWMDutyCycle>>3;
	else
		P1SECMPbits.SEVTCMP = 0;

	//Ramp-up period to detect the rotor position
	if(Flags.RotorAlignment && Flags.RunMotor)
		{
    	P1DC1=P1DC2=P1DC3=CurrentPWMDutyCycle;
		++PWMticks;
		}
	//Check if the Ramp-up value is disabled, if so starts sensorless operation
	if (++PWMticks>MAX_PWM_TICKS)
		PreCommutationState();

	// Masking the BEMF signals according to the SECTOR in order to determine the ACTIVE BEMF signal
	// XOR operator helps to determine the direction of the upcoming zero-crossing slope
	BlankingCounter++;
	if(BlankingCounter > BLANKING_COUNT){
		if((ComparatorOutputs^ADC_XOR[ADCCommState])& ADC_MASK[ADCCommState])
			adcBackEMFFilter|=0x01;
		
		//Majority detection filter	
		adcBackEMFFilter = ADC_BEMF_FILTER[adcBackEMFFilter];
		if (adcBackEMFFilter&0b00000001)
			PreCommutationState();	
	}
	IFS3bits.PWM1IF = 0;
}


/******************************************************************************
* Function:      _T1Interrupt(void)
*
* Output:		None
*
* Overview:		Here is where the motor commutation occurs, 
*				Timer1 ISR is utilized as the commutation delay used to 
*               commutate the motor windings at the right time
*
* Note:			None
*******************************************************************************/
void __attribute__((__interrupt__,auto_psv)) _T1Interrupt(void)
{

	P1OVDCON=PWM_STATE[ADCCommState];
	
	BlankingCounter = 0;
		
	IFS0bits.T1IF = 0; 		// Clear Timer 1 Interrupt Flag
	T1CONbits.TON = 0;		// Stop TIMER1
	TMR1 = 0;

}


/******************************************************************************
* Function:     PreCommutationState(void)
*
* Output:		None
*
* Overview:		This function measures the 60 and 30 electrical degrees
*				using the TIMER2. The 60 electrical degrees is proportional 
*				to the elpased time between zero-crossing events. 
*				The zero-crossing events occur 30 electrical degrees in advace 
*				of the commutation point. Hence a delay proportional to the 30
*				electrical degrees is added using the TIMER1
*
* Note:			None
*******************************************************************************/
void PreCommutationState(void)
{
	// Calculate the time proportional to the 60 electrical degrees
	T2CONbits.TON = 0;	// Stop TIMER2
	Timer2Average = ((Timer2Average + Timer2Value + TMR2)/3);
	Timer2Value = TMR2;
	TMR2 = 0;
	T2CONbits.TON = 1;	// Start TIMER2
	
	//Calculate the delay in TIMER1 counts proportional to the Phase Adv angle
	PhaseAdvance = ((Timer2Average*PHASE_ADVANCE_DEGREES)/60);
	
	// Calculate the time proportional to the 30 electrical degrees
	// Load the TIMER1 with  the TIMER1 counts porportional to 30 deg	minus the PHASE ADV angle delay
	Timer1Value = (((Timer2Average)>>1)-PhaseAdvance);
	if(Timer1Value>1)
		PR1 = Timer1Value;	
	else
		PR1 = Timer1Value = 1;	
	
	// Start TIMER1	
	T1CONbits.TON = 1;	  	

