Musadjan/AN1160_dsPIC33FJ32MC204/AN1160 MC204 dsPICDEM MCLV rev2.c
	//disabling rotor alignment & ramp-up sequence
	PWMticks = 0;
	RampUpCommState = 7;

	//if Motor is runnining in sensorless mode and the PI button is ON on DMIC window 
	//then the PI controller is enabled if the PI button is OFF then motor runs in open loop
	if((!Flags.RotorAlignment) && Flags.RunMotor){

#ifdef CLOSELOOPMODE
		SpeedPILoopController();
#else	
		OpenLoopController();
#endif
	}
		
	// Change The Six-Step Commutation Sector
	adcBackEMFFilter=0;
	if (++ADCCommState>6)
		ADCCommState=1;
}

/******************************************************************************
* Function:     SpeedPILoopController(void)
*
* Output:		None
*
* Overview:		When the PI button is ON on the DMCI window 
*				the motor operates in close loop mode. The Kp and Ki 
*				parameters were determined using the HURST MOTOR shipped with 
*				the MCLV board. These values should be modified according to 
*				the motorand load characteristics.
*
* Note:			None
*******************************************************************************/
#ifdef CLOSELOOPMODE
void SpeedPILoopController(void)
{
	//For the HURST motor the Timer2Avg values
	//TIMER2 counts = 66 AT 100% dutycycle (P1DC1 = 1469)	
	//TIMER2 counts = 1057 AT 4.9% dutycycle (P1DC1 = 72)
	//ADC POT RANGE 0-1024, 1024*3/2 = MAXDUTYCYCLE
	DesiredSpeed = (int)((ReferenceSpeed*3)/2);
		
	// Normalizing TIMER2 counts to electrical RPS expressed in PWM counts	
	// Timer 2 Counts are converted to PWM counts 
	// and then multipied by the number of sector
	// required to complete 1 electrical RPS
	CurrentSpeed = (int)((long)SPEEDMULT/(long)Timer2Average);

	//PID controller
	PIDStructure.controlReference = (fractional)DesiredSpeed;
	PIDStructure.measuredOutput = (fractional)CurrentSpeed;
	PID(&PIDStructure);
	
	//Max and Min Limimts for the PID output
	if (PIDStructure.controlOutput < 0)
		PIDStructure.controlOutput = MIN_DUTY_CYCLE;
	if (PIDStructure.controlOutput > MAX_DUTY_CYCLE) 
		{
		P1DC1 = MAX_DUTY_CYCLE;
		PIDStructure.controlOutput = MAX_DUTY_CYCLE;
		}
	else 
	  	CurrentPWMDutyCycle = PIDStructure.controlOutput;
	P1DC1 =	CurrentPWMDutyCycle;
	P1DC2 = CurrentPWMDutyCycle;
	P1DC3 = CurrentPWMDutyCycle;
}

/******************************************************************************
* Function:     OpenLoopController(void)
*
* Output:		None
*
* Overview:		When the PI button is OFF on the DMCI window 
*				the motor operates in open loop mode. 
*
* Note:			None
*******************************************************************************/
#else
void OpenLoopController(void)
{
	//PWM duty cycle = pot value *3/2
	DesiredPWMDutyCycle = (ReferenceSpeed*3)/2;
	//Update the duty cycle according to the POT value, a POT follower is implemented here
	if(CurrentPWMDutyCycle != DesiredPWMDutyCycle)
		{
		if(CurrentPWMDutyCycle < DesiredPWMDutyCycle)
			CurrentPWMDutyCycle++;		
		if(CurrentPWMDutyCycle > DesiredPWMDutyCycle)
			CurrentPWMDutyCycle--;
		}
	// Max and Min PWM duty cycle limits
	if (CurrentPWMDutyCycle < MIN_DUTY_CYCLE)
		CurrentPWMDutyCycle = MIN_DUTY_CYCLE;
	if (CurrentPWMDutyCycle > MAX_DUTY_CYCLE)
		CurrentPWMDutyCycle = MAX_DUTY_CYCLE;
	//Assigning new duty cycles to the PWM channels
	P1DC1 = CurrentPWMDutyCycle;
	P1DC2 = CurrentPWMDutyCycle;
	P1DC3 = CurrentPWMDutyCycle;

} 
#endif

/******************************************************************************
* Function:     InitADC10(void)
*
* Output:		None
*
* Overview:		Initializes the ADC module to operate in simultaneous mode
*				sampling terminals AN0,AN1, AN2, AN3 using MUX A. The ADC channels are
*				assigned as follows in the MCLV board
*				CH0->AN8  (POT)
*				CH1->AN3 PHASE A
*				CH2->AN4 PHASE B
*				CH3->AN5  PHASE C
* 				ADC is sync with the PWM. ADC is conversion is triggered
*				every time a PWM reload event occurs. Tadc = 84.75 nSec.
*				ADC resulting samples are formatted as unsigned 10-bits 
*				Right-justified 
*
* Note:			None
*******************************************************************************/
void InitADC10(void)
{

	AD1PCFGL = 0xFE00;	//Port pin multiplexed with AN0-AN8 in Analog mode
	
	AD1CON1 = 0x006C;   //ADC is off
						//Continue module operation in Idle mode
						//10-bit, 4-channel ADC operation
						//Data Output Format bits Integer (0000 00dd dddd dddd)
						//011 = Motor Control PWM interval ends sampling and starts conversion
						//Samples CH0, CH1, CH2, CH3 simultaneously when CHPS<1:0> = 1x
						//Sampling begins immediately after last conversion SAMP bit is auto-set.

	AD1CHS123 = 0x0001; //MUX B CH1, CH2, CH3 negative input is VREF-
						//MUX B CH1 positive input is AN0, CH2 positive input is AN1, CH3 positive input is AN2						
						//MUX A CH1, CH2, CH3 negative input is VREF-
						//MUX A CH1 positive input is AN3, CH2 positive input is AN4, CH3 positive input is AN5

	AD1CHS0 = 0x0008;   //MUX B Channel 0 negative input is VREF-
						//MUX B Channel 0 positive input is AN0
						//MUX A Channel 0 negative input is VREF-
						//MUX A Channel 0 positive input is AN8

	AD1CSSL = 0x0000;	//Skip all ANx channels for input scan

	AD1CON3 = 0x0002;	//ADC Clock derived from system clock
						//Autosample time time bits = 0 TAD sinjce PWM is controlling sampling time
						//TAD = 3*TCY, TAD = 101.7 nSec

	AD1CON2 = 0x0300;	//ADREF+ = AVDD ADREF- = AVSS
						//Do not scan inputs
						//1x = Converts CH0, CH1, CH2 and CH3
						//A/D is currently filling buffer 0x0-0x7
						//Interrupts at the completion of conversion for each sample/convert sequence
						//Always starts filling buffer from the beginning
						//Always uses channel input selects for Sample A

	AD1CON1bits.DONE = 0;	//Making sure that there is any conversion in progress
	IPC3bits.AD1IP = 5;		//Assigning ADC ISR priority
	IFS0bits.AD1IF = 0;		//Clearing the ADC Interrupt Flag
	IEC0bits.AD1IE = 1;		//Enabling the ADC conversion complete interrupt
	AD1CON1bits.ADON = 1;	//Enabling the ADC module

}


/******************************************************************************
* Function:     InitMCPWM(void)
*
* Output:		None
*
* Overview:		Initializes the PWM module to operate in center-aligned mode
*				at 20KHz. PWM terminals are configured in independent mode.
*				PWM time base is 67.8 nSec.
*				PDCx value range is 0-1464 for 0%-100% duty cycle 
*				ADC reload time is variable according to the PWM duty cycle
*
*
* Note:			None
*******************************************************************************/
void InitMCPWM(void)
{
	P1TPER = ((FCY/FPWM)/2 - 1);
							//FCY  29491200...FRC w/PLL x16
							//FPWM 20KHz PWM Freq
							// MAX_DUTY_CYCLE = 1469
							// 50% duty cycle = 734

	
