Musadjan/AN1160_dsPIC33FJ32MC204/AN1160 MC204 dsPICDEM MCLV rev2.c
	P1TCONbits.PTSIDL = 1;  // PWM time base halted in CPU IDLE mode
	P1TCONbits.PTOPS = 0;   // PWM time base 1:1 postscale
	P1TCONbits.PTCKPS = 0;  // PWM time base 1:1 prescale
	P1TCONbits.PTMOD = 2;	// Center Aligned with single interrupt mode per PWM period

	PWM1CON1 = 0x0700;		// disable PWMs
	P1OVDCON = 0x0000;		// allow control using OVD

	P1SECMPbits.SEVTDIR = 0; 	// trigger ADC when PWM counter is in upwards dir
								//....Tad=84.77, Tpwm=67.816
	P1SECMPbits.SEVTCMP = 0;	// generates a trigger event for the ADC
								// when PWM time base is counting upwards
								// just before reaching the PTPER value
								// causing a sampling in the middle of the 
								// pulse

	//FLTACON = 0x008F;			// The PWM output pin is driven Inactive on 
							// an external fault input event
							// The Fault A input pin latches all control pins to 0
							// PWMxH4-1/PWMxL4-1 pin pair is controlled by 
							// Fault Input A


    PWM1CON2 = 0x0000;		// 1:1 postscale values
							// Updates to the active PxDCy registers 
							// are sync to the PWM time base
							// Output overrides via the PxOVDCON register occur
							// on the next TCY boundary
							// Updates from duty cycle and period buffer registers 
							// are enabled

	IPC14bits.PWM1IP = 4;	// PWM Interrupt Priority 4
	IFS3bits.PWM1IF=0;		// Clearing the PWM Interrupt Flag
	IEC3bits.PWM1IE=1;		// Enabling the PWM interrupt


	P1TCONbits.PTEN = 1;	// Enabling the MC PWM module
}

/******************************************************************************
* Function:     InitTMR2(void)
*
* Output:		None
*
* Overview:		Initializes the TIMER2 module to operate in free-running 
*				up counting mode. The TIMER2 time base is Tcy*64= 2.17uSec.
*				This timer is used to calculate the motor speed
*
* Note:			None
*******************************************************************************/
void InitTMR2(void)
{							// Tcy = 33.908 nSec
	TMR2 = 0;				// Resetting TIMER
	PR2 = 0xFFFF;			// Setting TIMER periond to the MAX value
	T2CON = 0x0030;			// internal Tcy*64 clock = 2.17uSec
}


/******************************************************************************
* Function:     InitTMR1(void)
*
* Output:		None
*
* Overview:		Initializes the TIMER1 module to operate in free-running 
*				up counting mode. The TIMER1 time base is Tcy*64 = 2.64uSec.
*				This timer is used to calculate the commutation delay
*
* Note:			None
*******************************************************************************/
void InitTMR1(void)
{							// Tcy = 33.908 nSec
	TMR1 = 0;				// Resentting TIMER
	PR1 = 10;				// Intial commucation delay value 43.4 uSeg
	T1CON = 0x0030;			// internal Tcy*64 clock = 2.17uSec

	IPC0bits.T1IP = 5; 		// Set Timer 1 Interrupt Priority Level
	IFS0bits.T1IF = 0; 		// Clear Timer 1 Interrupt Flag
	IEC0bits.T1IE = 1; 		// Enable Timer1 interrupt
	T1CONbits.TON = 1; 		// Enable Timer1
	
}

/******************************************************************************
* Function:     DelayNmSec(unsigned int N)
*
* Output:		None
*
* Overview:		Delay funtion used for push buttons debounce loop and for the
*				motor start-up sequence
*
* Note:			None
*******************************************************************************/
void DelayNmSec(unsigned int N)
{
unsigned int j;
while(N--)
 	for(j=0;j < MILLISEC;j++);
}

